{
  "houses": [
    {
      "id": 0,
      "name": "Villa Savoye",
      "architect":	"Le Corbusier, Pierre Jeanneret",
      "img": "img/villa-savoye/villa-savoye_thumb.jpg",
      "lat": 48.9244,
      "lng": 2.0283,
      "category": "europe"
    },
    {
      "id": 1,
      "name": "Fallingwater",
      "architect": "Frank Lloyd Wright",
      "img": "img/fallingwater/fallingwater_thumb.jpg",
      "lat": 39.906111,
      "lng": -79.468056,
      "category": "us"
    },
    {
      "id": 2,
      "name": "Farnsworth House",
      "architect": "Ludwig Mies van der Rohe",
      "img": "img/farnsworth-house/farnsworth-house_thumb.jpg",
      "lat": 41.634989,
      "lng": -88.535722,
      "category": "us"
    },
    {
      "id": 3,
      "name": "4×4 House",
      "architect": "Tadao Ando",
      "img": "img/4x4/4x4_thumb.jpg",
      "lat": 34.64033126831055,
      "lng": 135.02439880371094,
      "category": "asia"
    },
    {
      "id": 4,
      "name": "Fifth house",
      "img": "http://via.placeholder.com/150x100?text=05",
      "lat": -35,
      "lng": 149.5,
      "category": "orange"
    },
    {
      "id": 5,
      "name": "Sixth house",
      "img": "http://via.placeholder.com/150x100?text=06",
      "lat": -32.397,
      "lng": 152.644,
      "category": "blue"
    },
    {
      "id": 6,
      "name": "Seventh house",
      "img": "http://via.placeholder.com/150x100?text=07",
      "lat": -31.77,
      "lng": 154.2,
      "category": "blue"
    },
    {
      "id": 7,
      "name": "Eight house",
      "img": "http://via.placeholder.com/150x100?text=08",
      "lat": -34.83,
      "lng": 155,
      "category": "red"
    },
    {
      "id": 8,
      "name": "Ninth house",
      "img": "http://via.placeholder.com/150x100?text=09",
      "lat": -34.6,
      "lng": 149.2,
      "category": "orange"
    },
    {
      "id": 9,
      "name": "Tenth house",
      "img": "http://via.placeholder.com/150x100?text=10",
      "lat": -37.4,
      "lng": 152.56,
      "category": "red"
    }
  ],
  "housesDetails": [
    {
      "id": 0,
      "architect": "Le Corbusier, Pierre Jeanneret",
      "buildingName": "Villa Savoye",
      "markup":
        "<p>Villa Savoye (French pronunciation: ​[sa.vwa]) is a modernist villa in Poissy, on the outskirts of Paris, France. It was designed by Swiss architects Le Corbusier and his cousin, Pierre Jeanneret, and built between 1928 and 1931 using reinforced concrete.<p><img class=\"img-responsive center-block modal-img\" src=\"img/villa-savoye/villa-savoye_01.jpg\" alt=\"villa-savoye\"><p>The house was originally built as a country retreat on behest of the Savoye family. After being purchased by the neighbouring school it passed on to be property of the French state in 1958, and after surviving several plans of demolition, it was designated as an official French historical monument in 1965 (a rare occurrence, as Le Corbusier was still living at the time). It was thoroughly renovated from 1985 to 1997, and under the care of the Centre des monuments nationaux, the refurbished house is now open to visitors year-round.</p><img class=\"img-responsive center-block modal-img\" src=\"img/villa-savoye/villa-savoye_02.jpg\" alt=\"villa-savoye\"><p>The Villa Savoye is probably Corbusier's best known building from the 1930s, and it had enormous influence on international modernism. It was designed addressing his emblematic \"Five Points\", the basic tenets in his new architectural aesthetic</p><img class=\"img-responsive center-block modal-img\" src=\"img/villa-savoye/villa-savoye_03.jpg\" alt=\"villa-savoye\"><p>Unlike his earlier town villas Corbusier was able to carefully design all four sides of the Villa Savoye in response to the view and the orientation of the sun. On the ground floor he placed the main entrance hall, ramp and stairs, garage, chauffeur and maid's rooms. At first floor the master bedroom, the son's bedroom, guest bedroom, kitchen, salon and external terraces. The salon was oriented to the south east whilst the terrace faced the east. The son's bedroom faced the north west and the kitchen and service terrace were on the south west. At second floor level were a series of sculpted spaces that formed a solarium.</p><img class=\"img-responsive center-block modal-img\" src=\"img/villa-savoye/villa-savoye_04.jpg\" alt=\"villa-savoye\"><p>Problems with the Savoyes caused by all the requests for additional payment from the contractors for all the changes were compounded by the requirement for early repairs to the new house. Each autumn the Savoyes suffered problems with rainwater leaks through the roof. By refusing downpipes and sills which would interrupt their aesthetic, the white surfaces were more susceptible to staining and erosion due to the water pour-down. Additionally, these building was also scarred with cracks because the material was not designed for structural durability. The Savoyes continued to live in the house until 1940, leaving during World War II. It was occupied twice during the war: first by the Germans – when it was used as a hay store – and then by the Americans, with both occupations damaging the building severely. The Savoyes returned to their estate after the war, but, no longer in position to live as they had done before the war, they abandoned the house again shortly after. The villa was expropriated by the town of Poissy in 1958, which first used it as a public youth center and later considered demolishing it to make way for a schoolhouse complex. Protest from architects who felt the house should be saved, and the intervention of Corbusier himself, spared the house from demolition. A first attempt of restoration was begun in 1963 by architect Jean Debuisson, despite opposition from Corbusier. The villa was added to the French register of historical monuments in 1965, becoming the first modernist building designated as historical monument in France, and also the first to be the object of restoration while its architect was still living. In 1985, a thorough state-funded restoration process, led by architect Jean-Louis Véret, was undertaken, being completed in 1997. The restoration included structural and surface repairs to the facades and terraces because of deterioration of the concrete, the installation of lighting and security cameras, and the reinstatement of some of the original fixtures and fittings.</p><img class=\"img-responsive center-block modal-img\" src=\"img/villa-savoye/villa-savoye_05.jpg\" alt=\"villa-savoye\"><p class=\"text-right\">Source: <a href=\"https://en.wikipedia.org/wiki/Villa_Savoye\" target=\"_blank\">wikipedia</a></p>"
    },
    {
      "id": 1,
      "architect": "Frank Lloyd Wright",
      "buildingName": "Fallingwater",
      "markup":
        "<p>Fallingwater is a house designed by architect Frank Lloyd Wright in 1935 in rural southwestern Pennsylvania, 43 miles (69 km) southeast of Pittsburgh. The house was built partly over a waterfall on Bear Run in the Mill Run section of Stewart Township, Fayette County, Pennsylvania, located in the Laurel Highlands of the Allegheny Mountains. The house was designed as a weekend home for the family of Liliane Kaufmann and her husband, Edgar J. Kaufmann, Sr., owner of Kaufmann's Department Store.<p><img class=\"img-responsive center-block modal-img\" src=\"img/fallingwater/fallingwater_01.jpg\" alt=\"Fallingwater\"><p>After its completion, Time called Fallingwater Wright's \"most beautiful job,\" and it is listed among Smithsonian's \"Life List of 28 places to visit before you die.\" The house was designated a National Historic Landmark in 1966. In 1991, members of the American Institute of Architects named Fallingwater the \"best all-time work of American architecture\" and in 2007, it was ranked 29th on the list of America's Favorite Architecture according to the AIA.</p><img class=\"img-responsive center-block modal-img\" src=\"img/fallingwater/fallingwater_02.jpg\" alt=\"Fallingwater\"><p>At age 67, Frank Lloyd Wright was given the opportunity to design and construct three buildings. With his three works of the late 1930s—Fallingwater; the Johnson Wax Building in Racine, Wisconsin; and the Herbert Jacobs house in Madison, Wisconsin—Wright regained his prominence in the architectural community.</p><img class=\"img-responsive center-block modal-img\" src=\"img/fallingwater/fallingwater_03.jpg\" alt=\"Fallingwater\"><p>Fallingwater was the family's weekend home from 1937 until 1963, when Edgar Kaufmann Jr. donated the property to the Western Pennsylvania Conservancy. The family retreated at Fallingwater on weekends to escape the heat and smoke of industrial Pittsburgh. Liliane enjoyed swimming in the nude and collecting modern art, especially the works of Diego Rivera, who was a guest at the country house.</p><img class=\"img-responsive center-block modal-img\" src=\"img/fallingwater/fallingwater_04.jpg\" alt=\"Fallingwater\"><p>Fallingwater stands as one of Wright's greatest masterpieces both for its dynamism and for its integration with its striking natural surroundings. Fallingwater has been described as an architectural tour de force of Wright's organic architecture. Wright's passion for Japanese architecture was strongly reflected in the design of Fallingwater, particularly in the importance of interpenetrating exterior and interior spaces and the strong emphasis placed on harmony between man and nature. Contemporary Japanese architect Tadao Ando has said of the house: \"I think Wright learned the most important aspect of architecture, the treatment of space, from Japanese architecture. When I visited Fallingwater in Pennsylvania, I found that same sensibility of space. But there was the additional sounds of nature that appealed to me.\"</p><img class=\"img-responsive center-block modal-img\" src=\"img/fallingwater/fallingwater_05.jpg\" alt=\"Fallingwater\"><p class=\"text-right\">Source: <a href=\"https://en.wikipedia.org/wiki/Fallingwater\" target=\"_blank\">wikipedia</a></p>"
    },
    {
      "id": 2,
      "architect": "Ludwig Mies van der Rohe",
      "buildingName": "Farnsworth House",
      "markup": "<p>The Farnsworth House was designed and constructed by Ludwig Mies van der Rohe between 1945 and 1951. It is a one-room weekend retreat in a once-rural setting, located 55 miles (89 km) southwest of Chicago's downtown on a 60-acre (24 ha) estate site, adjoining the Fox River, south of the city of Plano, Illinois. The steel and glass house was commissioned by Dr. Edith Farnsworth, a prominent Chicago nephrologist, as a place where she could engage in her hobbies — playing the violin, translating poetry, and enjoying nature.</p><img class=\"img-responsive center-block modal-img\" src=\"img/farnsworth-house/farnsworth-house_01.jpg\" alt=\"Farnsworth House\"><p>The essential characteristics of the house are immediately apparent. The extensive use of clear floor-to-ceiling glass opens the interior to its natural surroundings to an extreme degree. Two distinctly expressed horizontal slabs, which form the roof and the floor, sandwich an open space for living. The slab edges are defined by exposed steel structural members painted pure white.</p><img class=\"img-responsive center-block modal-img\" src=\"img/farnsworth-house/farnsworth-house_02.jpg\" alt=\"Farnsworth House\"><p>The house is elevated 5 feet 3 inches (1.60 m) above a flood plain by eight wide flange steel columns which are attached to the sides of the floor and ceiling slabs. The slabs' ends extend beyond the column supports, creating cantilevers. A third floating slab, an attached terrace, acts as a transition between the living area and the ground. The house is accessed by two sets of wide steps connecting ground to terrace and then to porch.</p><img class=\"img-responsive center-block modal-img\" src=\"img/farnsworth-house/farnsworth-house_03.jpg\" alt=\"Farnsworth House\"><p>The Farnsworth House sits on a floodplain that faces the Fox River, differentiating the vast meadow and a variety of trees from its white exterior. The isolated, private residence establishes the architects concept of simple living.</p><img class=\"img-responsive center-block modal-img\" src=\"img/farnsworth-house/farnsworth-house_04.jpg\" alt=\"Farnsworth House\"><p class=\"text-right\">Source: <a href=\"https://en.wikipedia.org/wiki/Farnsworth_House\" target=\"_blank\">wikipedia</a></p>" 
    },
    {
      "id": 3,
      "architect": "Tadao Ando",
      "buildingName": "4×4 House",
      "markup": "<div class=\"row\"><div class=\"col-sm-6\"><img class=\"img-responsive center-block modal-img\" src=\"img/4x4/4x4_01.jpg\" alt=\"4x4 House\"></div><div class=\"col-sm-6\"><p>The first house to emerge as a result of a competition organised by a magazine and presented to the client with the famous architect, Tadao Ando. The 4×4 House was adapted to the requirements of the site. A decisive factor in the project was the Hanshin earthquake which had caused terrible devastation in the area. An unusual location, on a narrow and chaotic strip of land very close to the epicentre of the earthquake on the 17th of August 1995, with a landowner willing to follow his architect. He permitted Ando to convert the site into a ground-breaking house, silently remembering  the great seism.</p></div></div><p>Once the construction was finished, another client asked Tadao Ando for a similar house on a neighbouring piece of land. With this commission, the architect could complete his original idea of two houses, though without the communication between them that he had envisioned, and using different materials.</p><img class=\"img-responsive center-block modal-img\" src=\"img/4x4/4x4_05.jpg\" alt=\"4x4 House\"><p>The houses are located near the Hyogo coast, on the outskirts of Kobe, along a commercial strip and bordered by a dual carriageway and train tracks to the North and, on its other side, by the widest-spanning bridge in Japan, the Akashi Strait, where the sandy beach meets the Seto Inland Sea. One of the factors which attracted the architect’s attention was the view over the island of Awaji, the epicentre of the Hanshin earthquake in 1995 and where he built the Temple of Water and the Yumeibutai.</p><img class=\"img-responsive center-block modal-img\" src=\"img/4x4/4x4_02.jpg\" alt=\"4x4 House\"><p>An important part of the concept of the 4×4 house was not only the treatment of light and water, but also the sound of the wind. The house combined a rigorous use of geometry with the intention to create a piece of architecture which, in this case, becomes part of the sea. Tadao Ando uses geometric bases for his designs: squares, circles, triangles and rectangles. He is always looking to achieve the balance between the building and the natural surroundings.</p><img class=\"img-responsive center-block modal-img\" src=\"img/4x4/4x4_03.jpg\" alt=\"4x4 House\"><p>On each of the floors a distinct function is developed: a storeroom in the basement, entryway and service area on the ground floor, a bedroom on the first floor, study on the second and, on the final floor, a combined kitchen, dining room and living room which forms the focal point of the house. This final level is a 4 metre cube with a floor-to-ceiling glass elevation on the South-East side which towers over the water like a gigantic, square telescopic lens and captures the views.</p><img class=\"img-responsive center-block modal-img\" src=\"img/4x4/4x4_04.jpg\" alt=\"4x4 House\"><p class=\"text-right\">Source: <a href=\"https://en.wikiarquitectura.com/building/4x4-house/\" target=\"_blank\">wikiarquitectura</a></p>" 
    }
  ]
}
